<h1>Penggunaan Perintah SELECT FROM</h1>

Untuk mengakses data di database, dapat menggunakan SELECT statement yang mana dapat berguna untuk menampilkan data yang ingin ditampilkan.

Ingat, tanda (*) --> menampilkan seluruh item kolom

```sql
SELECT name_column FROM name_table;

```

Catatan:
1. SELECT artinya ingin mengambil data
2. name_column artinya ingin memilih kolom tertentu, apabila ingin semua kolom dapat dengan (*)
3. FROM artinya lokasi data berada dengan menunjukkan name_tablenya
4. tanda (;) artinya akhir perintah SQL

In [ ]:
# !pip install psycopg2

In [ ]:
import psycopg2 as pg
import pandas.io.sql as psql
import pandas as pd

In [ ]:
# Bangun konektivitas
host = "ec2-54-164-22-242.compute-1.amazonaws.com"
dbname = "d92sarup3qlji0"
user = "fttxsdmckdfikz"
password = "c5561e667cd292f382a0e437807e05c89fba1b894dddff1e77e07befe8a866ac"
connection = pg.connect(f"host={host} dbname={dbname} user={user} password={password}")

# Function SQL
def sql(doc):
    return psql.read_sql_query(doc, connection)

In [ ]:
# Mengenal SELECT 
# list_table_name: 
# orders, order_details, products, customers 

# All dataset
sql(
"""
SELECT * FROM orders;
""").head(5)

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country,born_year
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France,None
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany,None
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil,None
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France,None
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium,None

In [ ]:
# Kolom tertentu
sql('SELECT ship_country FROM orders;').head(5)

  ship_country
0       France
1      Germany
2       Brazil
3       France
4      Belgium

bagaimana mengambil kolom ship_region dan ship_postal_code?

In [ ]:
# Tulis disini ya!

Catatan:

Jika kita mau menarik lebih dari satu kolom, bukan semua kolom ya!

```sql
SELECT column_name1, column_name2 FROM table_name
```

Ini artinya dengan memberi tanda (,) dalam penulisannya. Cukup sederhana bukan?

Jika kita hanya mengambil 5 data dari data kita sebelumnya tersebut?

In [ ]:
# Kolom tertentu
sql('SELECT ship_country, ship_postal_code FROM orders;').head(5)

  ship_country ship_postal_code
0       France            51100
1      Germany            44087
2       Brazil        05454-876
3       France            69004
4      Belgium           B-6000

In [ ]:
# Tulis disini ya!

Catatan:

Jika kita mau menarik hanya sebagian row dapat dilakukan seperti berikut ini

```sql
SELECT column_name1, column_name2 FROM table_name LIMIT n
```

n merupakan jumlah batasan yang akan ditampilkan dalam database

Jika kita ingin mengambil data yang unique dari database bagaimana?

In [ ]:
# dibatasi
sql('SELECT ship_country, ship_postal_code FROM orders LIMIT 5;')

  ship_country ship_postal_code
0       France            51100
1      Germany            44087
2       Brazil        05454-876
3       France            69004
4      Belgium           B-6000

In [ ]:
# Tulis disini ya!

Catatan:

Jika kita mau menarik dengan yang unik tanpa duplikasi, sebagai berikutnya

```sql
SELECT DISTINCT column_name1, column_name2 FROM table_name LIMIT n
```

DISTINCT akan berguna untuk mengambil data tanpa duplikasi.

In [ ]:
# dua kolom
sql('SELECT ship_country, ship_postal_code FROM orders;').shape

(830, 2)

In [ ]:
# dua kolom
sql('SELECT DISTINCT ship_country, ship_postal_code FROM orders;').shape

(85, 2)

**KESIMPULAN**
1. Perintah SELECT dapat digunakan untuk menentukan apa saja kolom yang akan diambil dengan menuliskan nama-nama kolom yang diinginkan menggunakan pemisah tanda koma.
2. Perintah SELECT juga dapat digunakan untuk membatasi jumlah data yang dikeluarkan. Namun untuk berbagai produk bisa berbeda penulisannya. MySQL menggunakan LIMIT untuk tujuan tersebut.
3. Perintah SELECT DISTINCT dapat digunakan untuk menghilangkan duplikasi baris dalam tabel dan hanya menampilkan baris data yang unik tanpa duplikasi.